lvx/base/Documents/бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийКазначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УдалитьХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежаУпр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_Важность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверхБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбъектРасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектРасчетов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписатьЛимиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/AccumulationRegisters/бит_кзн_ПланируемыйРасходДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_кзн_ПланируемыйРасходДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_ВидыПланов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ПлатежнаяПозиция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

lvx/base/AccumulationRegisters/бит_кзн_ПланируемоеПоступлениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_кзн_ПланируемоеПоступлениеДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПлана</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_ВидыПланов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_кзн_ПозицияПоступления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

lvx/base/Enums/бит_ВидыОперацийКазначейства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийКазначейства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяПередачаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствВДругуюОрганизацию</Name>
					<Comment>Для наличных и безналичных расчетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствВДругуюКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыНаЛицевыеСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыПоЗарплатномуПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыРаботнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыРаздатчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыЧерезКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыНаПлатежнуюКарту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияДенежныхСредствИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонвертацияВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаАрендодателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДенежныхСредствВДругуюОрганизацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДенежныхСредствНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНаДепозиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеТаможне</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеДенежныхСредствИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочаяВыдачаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаДенежныхСредствВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияДенежныхСредствВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеВБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеДенежныхСредствИзДругойОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствОтДругойОрганизации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Documents/бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
#Область ОбновлениеИнформационнойБазы

#КонецОбласти

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
		
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВариантыОтчетов
// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ИнтеграцияИСПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВариантыОтчетов

// Возвращает параметры механизма взаиморасчетов.
//
// Параметры:
// 	ДанныеЗаполнения - ДокументОбъект, СправочникОбъект, Структура, ДанныеФормыСтруктура - Объект или коллекция для
//              расчета параметров взаиморасчетов.
//
// Возвращаемое значение:
// 	Структура - Структура параметров функций механизма взаиморасчетов (См. ВзаиморасчетыСервер.ПараметрыМеханизма)
//
Функция ПараметрыВзаиморасчеты(ДанныеЗаполнения = Неопределено) Экспорт
	
	Если ДанныеЗаполнения = Неопределено Тогда
		ХозяйственнаяОперация = Неопределено;
	Иначе
		ХозяйственнаяОперация = ДанныеЗаполнения.ХозяйственнаяОперация;
	КонецЕсли;
	
	СтруктураПараметров = ВзаиморасчетыСервер.ПараметрыМеханизма();
			
	Если ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВозвратДенежныхСредствВДругуюОрганизацию Тогда
		СтруктураПараметров.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	ИначеЕсли ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаДенежныхСредствВДругуюОрганизацию Тогда
		СтруктураПараметров.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
	КонецЕсли;
	
	СтруктураПараметров.ИзменяетПланОплаты = ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВозвратДенежныхСредствВДругуюОрганизацию
		ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаДенежныхСредствВДругуюОрганизацию;
	
	СтруктураПараметров.ИзменяетПланОтгрузкиПоставки = Ложь;
	
	Если ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ВозвратДенежныхСредствВДругуюОрганизацию
		ИЛИ ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаДенежныхСредствВДругуюОрганизацию Тогда
		СтруктураПараметров.Контрагент = "Объект.ОрганизацияПолучатель";
	Иначе
		СтруктураПараметров.Контрагент = "";
	КонецЕсли;
	
	СтруктураПараметров.ВалютаДокумента                  = "Объект.ВалютаДокумента";
	// Изменение кода. Начало. 18.10.2021{{ 
	// "Курс" переименован в "КурсЧислитель", "Кратность" - "КурсЗнаменатель".
	СтруктураПараметров.КурсЧислитель             = "";
	СтруктураПараметров.КурсЗнаменатель           = "";
	// Изменение кода. Конец. 18.10.2021}}
	СтруктураПараметров.ПорядокРасчетов                  = "";
	
	СтруктураПараметров.ФормаОплаты                      = "";
	СтруктураПараметров.ОплатаВВалюте                    = "";
	СтруктураПараметров.Партнер                          = "";
	СтруктураПараметров.Договор                          = "";
	
	СтруктураПараметров.ПутьКДаннымТЧРасшифровкаПлатежа  = "";
	СтруктураПараметров.Соглашение                       = "";
	СтруктураПараметров.БанковскийСчетОрганизации        = ""; 
	СтруктураПараметров.НалогообложениеНДС               = "";
	СтруктураПараметров.НаправлениеДеятельности			  = "";
	
	СтруктураПараметров.ЭлементыФормы.РасшифровкаПлатежа       = "";
	СтруктураПараметров.ЭлементыФормы.ПодборВРасшифровкуПлатежа  = "";
	СтруктураПараметров.ПлатежиПо275ФЗ                           = "";
	 
	Возврат СтруктураПараметров;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция определяет новый статус объекта в зависимости от режима записи документа
//и предыдущего статуса. Механизм определения статусов может быть переопределен алгоритмами.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию.
//  ПараметрыУстановкиСтатуса - Структура - состав полей см. в функции бит_ВизированиеСервер.НовыеПараметрыУстановкиСтатуса.
//
// Возвращаемое значение:
//   НовыйСтатус - СправочникСсылка.бит_СтатусыОбъектов.
//
Функция НовыйСтатусОбъекта(ТекущийОбъект, ПараметрыУстановкиСтатуса) Экспорт
	
	Если ПараметрыУстановкиСтатуса.ПараметрыОплаты = Неопределено Тогда
		СтруктураРасход      = Документы.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию.ПолучитьОстатокРасход(ТекущийОбъект.Ссылка);
		СтруктураПоступления = Документы.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию.ПолучитьОстатокПоступление(ТекущийОбъект.Ссылка);
		СтруктураОплаты = Новый Структура("Расход, Поступление", СтруктураРасход, СтруктураПоступления);
	Иначе	
		СтруктураОплаты = ПараметрыУстановкиСтатуса.ПараметрыОплаты;
	КонецЕсли;
	
	РежимЗаписи = ПараметрыУстановкиСтатуса.РежимЗаписи;
	
	ПроводитьПослеУтверждения = ОбщегоНазначения.ЕстьРеквизитОбъекта("ОтправленНаСогласование", ТекущийОбъект.Метаданные())
									И ПолучитьФункциональнуюОпцию("бит_ПроводитьДокументыПослеУтверждения");
									
	Если ПроводитьПослеУтверждения Тогда
		Если НЕ ТекущийОбъект.ОтправленНаСогласование Тогда
			Возврат Справочники.бит_СтатусыОбъектов.Черновик;
		КонецЕсли;
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		ИЛИ (РежимЗаписи = РежимЗаписиДокумента.Запись И НЕ ТекущийОбъект.Проведен) Тогда
		Возврат Справочники.бит_СтатусыОбъектов.Черновик;
	КонецЕсли;
	
	БезПоступлений = бит_ОбщегоНазначенияПовтИсп.ЗначениеПеременной("бит_кзн_НеСоздаватьДокументыПоступления");
	
	СсылкаНаОбъект = ТекущийОбъект.Ссылка;
	
	Если бит_ВизированиеСервер.ЕстьБлокирующиеРешения(СсылкаНаОбъект) Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.Отклонен;
		
	ИначеЕсли (БезПоступлений ИЛИ СтруктураОплаты.Поступление.Остаток <= 0.01 И СтруктураОплаты.Поступление.Факт > 0)
			И СтруктураОплаты.Расход.Остаток <= 0.01 И СтруктураОплаты.Расход.Факт > 0 Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.Оплачен;
		
	ИначеЕсли СтруктураОплаты.Поступление.Факт > 0 ИЛИ СтруктураОплаты.Расход.Факт > 0 Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.ЧастичноОплачен;
		
		
	ИначеЕсли бит_ВизированиеСервер.ВсеВизыСогласованы(СсылкаНаОбъект) Тогда
		
		Возврат Справочники.бит_СтатусыОбъектов.Утвержден;
		
	КонецЕсли;
	
	Возврат Справочники.бит_СтатусыОбъектов.НаСогласовании;
	
КонецФункции

// Добавляет команду создания документа "Заявка на перевод денежных средств в другую организацию".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = НСтр("ru='Заявка на перевод денежных средств в другую организацию';
													   |en='Application for transfer of funds to another organization'");
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";		
		Возврат КомандаСоздатьНаОсновании;		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ПриИзмененииВалютыДокумента(Документ, Дата) Экспорт
	
	КурсыВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Документ.ВалютаДокумента, Дата);
	
	Документ.КурсДокумента 	    = КурсыВалюты.Курс;
	Документ.КратностьДокумента = КурсыВалюты.Кратность;		

КонецПроцедуры

// Функция создает платежный документ.
//
// Параметры:
//  ПараметрыДокумента - Структура. См бит_Казначейство.НовыеПараметрыСозданияПлатежногоДокумента.
//
// Возвращаемое значение:
//  ПлатежныеДокументы - Массив.
//
Функция СоздатьПлатежныйДокументНаОсновании(ПараметрыДокумента) Экспорт 
	
	ДокументОснование = ПараметрыДокумента.ДокументОснование;
	ДатаДокумента     = ПараметрыДокумента.ДатаДокумента;
	ИзРеестра   	  = ПараметрыДокумента.ВызовИзРеестра;
	СуммаКОплате      = ПараметрыДокумента.СуммаКОплате;
	РежимЗаписи 	  = ПараметрыДокумента.РежимЗаписи;
	
	Отказ = Ложь;
	бит_Казначейство.ПроверитьПлатежныеПозицииИзРеестраПоИсточникуВызова(Неопределено, ПараметрыДокумента, Отказ);
	Если Отказ Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ПлатежныеДокументы   = Новый Массив;
	СоздаватьПоступления = НЕ бит_ОбщегоНазначенияПовтИсп.ЗначениеПеременной("бит_кзн_НеСоздаватьДокументыПоступления");
	РеквизитыОснования 	 = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, 
								"Организация, ОрганизацияПолучатель, ВалютаДокумента, СуммаДокумента," 
								"ХозяйственнаяОперация, ФормаОплаты, Ссылка, ОбъектРасчетов, СтавкаНДС, СуммаНДС");
	
	Если ИзРеестра Тогда
		СуммаДокумента	 = ПараметрыДокумента.СуммаКОплате;
		ФактическаяСумма = ПараметрыДокумента.СуммаКОплате;
	Иначе 
		СуммаДокумента	 = РеквизитыОснования.СуммаДокумента;
		ФактическаяСумма = 0;
	КонецЕсли; 

	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ИзРеестра", 			 ИзРеестра);
	ПараметрыЗаполнения.Вставить("СоздаватьПоступления", СоздаватьПоступления);
	ПараметрыЗаполнения.Вставить("ПлатежныеДокументы", 	 ПлатежныеДокументы);
	ПараметрыЗаполнения.Вставить("ДатаДокумента", 		 ДатаДокумента);
	ПараметрыЗаполнения.Вставить("СуммаДокумента", 		 СуммаДокумента);
	ПараметрыЗаполнения.Вставить("ФактическаяСумма", 	 ФактическаяСумма);
	
	ВидОперации = бит_Казначейство.ХозяйственнаяОперацияУП(РеквизитыОснования.ХозяйственнаяОперация);
	Попытка
		НачатьТранзакцию();
		// Возврат денежных средств от другой организации: ВозвратДенежныхСредствОтДругойОрганизации
		Если ВидОперации = Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств Тогда
			Если РеквизитыОснования.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда
				ЗаполнитьВнутреннююПередачуДенежныхСредствЧерезБанк(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы);
			Иначе
				ЗаполнитьВнутреннююПередачуДенежныхСредствЧерезКассу(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы);
			КонецЕсли;
		ИначеЕсли ВидОперации = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию Тогда	
			Если РеквизитыОснования.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда
				ЗаполнитьОплатуДенежныхСредствВДругуюОрганизациюЧерезБанк(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы);
			Иначе
				ЗаполнитьОплатуДенежныхСредствВДругуюОрганизациюЧерезКассу(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы);
			КонецЕсли; 
		ИначеЕсли ВидОперации = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию Тогда
			Если РеквизитыОснования.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда
				ЗаполнитьВозвратДенежныхСредствВДругуюОрганизациюЧерезБанк(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы);
			Иначе
				ЗаполнитьВозвратДенежныхСредствВДругуюОрганизациюЧерезКассу(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы);
			КонецЕсли;	
		ИначеЕсли ВидОперации = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации Тогда
			Если РеквизитыОснования.ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные Тогда
				ЗаполнитьВозвратДенежныхСредствОтДругойОрганизацииЧерезБанк(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы);
			Иначе
				ЗаполнитьВозвратДенежныхСредствОтДругойОрганизацииЧерезКассу(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы);
			КонецЕсли;
		КонецЕсли;	
			ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ПлатежныеДокументы.Очистить();
		
		ТекстСообщения = НСтр("ru = 'Не удалось записать документы оплаты по причине: %1.'; 
								|en = 'Failed to record payment documents due to: %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Для каждого Документ Из ПлатежныеДокументы Цикл
			Попытка
				ТекущийОбъект = Документ.ПолучитьОбъект();
				ТекущийОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ТекстСообщения = НСтр("ru = 'Не удалось провести документ оплаты по причине: %1.'; 
										|en = 'Failed to record payment document due to: %1'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ);
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;

	Возврат ПлатежныеДокументы;
	
КонецФункции

// Функция получает неоплаченный остаток по расходованию.
//
// Параметры:
//   ДокументПланирования - ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеСредств
//
// Возвращаемое значение:
//  СтрОплата - Структура.
//
Функция ПолучитьОстатокРасход(ДокументПланирования) Экспорт

	СтрОплата = Новый Структура("План, Факт, Остаток",0, 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПланирования", ДокументПланирования);
	Запрос.УстановитьПараметр("Организация"         , ДокументПланирования.Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ПлРасходОстаткиИОбороты.СуммаКонечныйОстаток, 0) КАК СуммаОстаток,
	               |	ЕСТЬNULL(ПлРасходОстаткиИОбороты.СуммаПриход, 0) КАК СуммаПлан,
	               |	ЕСТЬNULL(ПлРасходОстаткиИОбороты.СуммаРасход, 0) КАК СуммаФакт
	               |ИЗ
	               |	РегистрНакопления.бит_кзн_ПланируемыйРасходДенежныхСредств.ОстаткиИОбороты(
	               |			,
	               |			,
	               |			,
	               |			,
	               |			ДокументПланирования = &ДокументПланирования
	               |				И Организация = &Организация) КАК ПлРасходОстаткиИОбороты";

	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтрОплата.План    = Выборка.СуммаПлан;
		СтрОплата.Факт    = Выборка.СуммаФакт;
		СтрОплата.Остаток = Выборка.СуммаОстаток;
	
	КонецЕсли; 

	Возврат СтрОплата;
	
КонецФункции // ПолучитьОстаток()

// Функция получает неоплаченный остаток по поступлению.
//
// Параметры:
//   ДокументПланирования - ДокументСсылка.бит_кзн_ЗаявкаНаПеремещениеСредств
//
// Возвращаемое значение:
//  СтрОплата - Структура.
//
Функция ПолучитьОстатокПоступление(ДокументПланирования) Экспорт

	СтрОплата = Новый Структура("План, Факт, Остаток",0, 0, 0);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументПланирования", ДокументПланирования);
	Запрос.УстановитьПараметр("Организация"         , ДокументПланирования.ОрганизацияПолучатель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ПлПоступлениеОстаткиОбороты.СуммаКонечныйОстаток, 0) КАК СуммаОстаток,
	               |	ЕСТЬNULL(ПлПоступлениеОстаткиОбороты.СуммаПриход, 0) КАК СуммаПлан,
	               |	ЕСТЬNULL(ПлПоступлениеОстаткиОбороты.СуммаРасход, 0) КАК СуммаФакт
	               |ИЗ
	               |	РегистрНакопления.бит_кзн_ПланируемоеПоступлениеДенежныхСредств.ОстаткиИОбороты(
	               |			,
	               |			,
	               |			,
	               |			,
	               |			ДокументПланирования = &ДокументПланирования
	               |				И Организация = &Организация) КАК ПлПоступлениеОстаткиОбороты";

	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтрОплата.План    = Выборка.СуммаПлан;
		СтрОплата.Факт    = Выборка.СуммаФакт;
		СтрОплата.Остаток = Выборка.СуммаОстаток;
	
	КонецЕсли; 

	Возврат СтрОплата;
	
КонецФункции // ПолучитьОстаток()

// Функция возвращает перечень синхронизируемых реквизитов позиции и заявки.
//
// Возвращаемое значение:
//  Имена - Массив.
//
Функция СинхронизируемыйРеквизитыДляПеремещения() Экспорт 

	Имена = Новый Массив;
	
	Имена.Добавить("ХозяйственнаяОперация");
	Имена.Добавить("СуммаДокумента");	
	Имена.Добавить("ВалютаДокумента");
	Имена.Добавить("КурсДокумента");
	Имена.Добавить("Важность");
	Имена.Добавить("НазначениеПлатежа");
	Имена.Добавить("НазначениеПлатежаУпр");
	Имена.Добавить("Инициатор");
	Имена.Добавить("Ответственный");
	Имена.Добавить("ФормаОплаты");
	Имена.Добавить("СверхБюджета");
	Имена.Добавить("СписатьЛимиты");
	Имена.Добавить("Сценарий");
	Имена.Добавить("СтавкаНДС");
	Имена.Добавить("СуммаНДС");
	
	Возврат Имена;
	
КонецФункции // СинхронизируемыйРеквизитыДляПремещения()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеПлатежныхДокументов

Функция ДанныеПозиций(ДокументОснование)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПлатежнаяПозиция.БанковскийСчет КАК БанковскийСчет,
	|	ПлатежнаяПозиция.Касса КАК Касса,
	|	ПлатежнаяПозиция.Ссылка КАК Позиция,
	|	ПлатежнаяПозиция.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ПлатежнаяПозиция.СтатьяОборотов КАК СтатьяОборотов
	|ИЗ
	|	Документ.бит_кзн_ПлатежнаяПозиция КАК ПлатежнаяПозиция
	|ГДЕ
	|	ПлатежнаяПозиция.ДокументПланирования = &ДокументПланирования
	|	И НЕ ПлатежнаяПозиция.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПозицияПоступления.БанковскийСчет КАК БанковскийСчет,
	|	ПозицияПоступления.Касса КАК Касса,
	|	ПозицияПоступления.Ссылка КАК Позиция,
	|	ПозицияПоступления.НазначениеПлатежа КАК НазначениеПлатежа,
	|	ПозицияПоступления.СтатьяОборотов КАК СтатьяОборотов
	|ИЗ
	|	Документ.бит_кзн_ПозицияПоступления КАК ПозицияПоступления
	|ГДЕ
	|	ПозицияПоступления.ДокументПланирования = &ДокументПланирования
	|	И НЕ ПозицияПоступления.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументПланирования", ДокументОснование);
	
	Результат = Запрос.ВыполнитьПакет();
	ВыборкаРасход = Результат[0].Выбрать();
	ВыборкаПриход = Результат[1].Выбрать();
	
	
	Имена = "БанковскийСчет, Касса, Позиция, НазначениеПлатежа, СтатьяОборотов";
	ПлатежнаяПозиция   = Новый Структура(Имена);
	ПозицияПоступления = Новый Структура(Имена);
	
	Пока ВыборкаРасход.Следующий() Цикл	
		ЗаполнитьЗначенияСвойств(ПлатежнаяПозиция, ВыборкаРасход);
	КонецЦикла;
	
	Пока ВыборкаПриход.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПозицияПоступления, ВыборкаПриход);
	КонецЦикла;
	
	ДанныеПозиций = Новый Структура;
	ДанныеПозиций.Вставить("ПлатежнаяПозиция",	 ПлатежнаяПозиция);
	ДанныеПозиций.Вставить("ПозицияПоступления", ПозицияПоступления);
	
	Возврат ДанныеПозиций;
	
КонецФункции

Процедура ЗаполнитьВнутреннююПередачуДенежныхСредствЧерезКассу(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы)
		
	ДокументОснование = РеквизитыОснования.Ссылка;
	ДанныеПозиций	  = ДанныеПозиций(ДокументОснование);
	ДатаДокумента	  = ПараметрыЗаполнения.ДатаДокумента;
	ФактическаяСумма  = ПараметрыЗаполнения.ФактическаяСумма;
	
	// Расшифровка платежа не требуется.
	ДанныеЗаполнения = ДанныеЗаполненияСписаниеЧерезКассу(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, 
							Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств);
								
	ДокументОбъект = Документы.РасходныйКассовыйОрдер.СоздатьДокумент();
	ДокументОбъект.Дата = ДатаДокумента;		
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ДокументОбъект.Записать();
	
	ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
	ЗаполнитьОтражениеФактаДДС(ДокументОснование, ДокументОбъект.Ссылка, ДанныеПозиций, "Первая", ФактическаяСумма);
	
	ДанныеЗаполнения = ДанныеЗаполненияПоступлениеЧерезКассу(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения,
							Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств);
		
	ДокументОбъект = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
	ДокументОбъект.Дата = ДатаДокумента;		
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ДокументОбъект.Записать();
	
	ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
	ЗаполнитьОтражениеФактаДДС(ДокументОснование, ДокументОбъект.Ссылка, ДанныеПозиций, "Вторая", ФактическаяСумма);

КонецПроцедуры

Процедура ЗаполнитьВнутреннююПередачуДенежныхСредствЧерезБанк(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы)
		
	ДокументОснование 	 = РеквизитыОснования.Ссылка;
	ДанныеПозиций	  	 = ДанныеПозиций(ДокументОснование);
	СоздаватьПоступления = ПараметрыЗаполнения.СоздаватьПоступления;
	ДатаДокумента		 = ПараметрыЗаполнения.ДатаДокумента;
	
	СуммаДокумента	 = ПараметрыЗаполнения.СуммаДокумента;
	ФактическаяСумма = ПараметрыЗаполнения.ФактическаяСумма;
	
	ДанныеЗаполнения = ДанныеЗаполненияСписаниеЧерезБанк(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, 
							Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств);
								
	ДокументОбъект = Документы.СписаниеБезналичныхДенежныхСредств.СоздатьДокумент();
	// Расшифровка платежа не требуется.
	//бит_Казначейство.ДополнитьНазначениеПлатежаСуммой(ДокументОбъект);
	ДокументОбъект.Дата = ДатаДокумента;		
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ДокументОбъект.Записать();
	
	Списание = ДокументОбъект.Ссылка;
	ПлатежныеДокументы.Добавить(Списание);
	ЗаполнитьОтражениеФактаДДС(ДокументОснование, Списание, ДанныеПозиций, "Первая", ФактическаяСумма);
	
	Если СоздаватьПоступления Тогда
		
		ДанныеЗаполнения = ДанныеЗаполненияПоступлениеЧерезБанк(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, 
								Перечисления.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств);
											
		ДокументОбъект = Документы.ПоступлениеБезналичныхДенежныхСредств.СоздатьДокумент();
		//бит_Казначейство.ДополнитьНазначениеПлатежаСуммой(ДокументОбъект);
		ДокументОбъект.Дата = ДатаДокумента;
		РеквизитыВходящего 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Списание, 
								"НомерВходящегоДокумента, ДатаВходящегоДокумента");
		ЗаполнитьЗначенияСвойств(ДокументОбъект, РеквизитыВходящего);
		ДокументОбъект.Заполнить(ДанныеЗаполнения);
		ДокументОбъект.Записать();
		
		ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
		ЗаполнитьОтражениеФактаДДС(ДокументОснование, ДокументОбъект.Ссылка, ДанныеПозиций, "Вторая", ФактическаяСумма);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьОплатуДенежныхСредствВДругуюОрганизациюЧерезКассу(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы)
	
	ДокументОснование = РеквизитыОснования.Ссылка;
	ДанныеПозиций	  = ДанныеПозиций(ДокументОснование);
	ДатаДокумента	  = ПараметрыЗаполнения.ДатаДокумента;
	ФактическаяСумма  = ПараметрыЗаполнения.ФактическаяСумма;
	
	ДанныеЗаполнения = ДанныеЗаполненияСписаниеЧерезКассу(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения,
							Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию);
	
	ДокументОбъект = Документы.РасходныйКассовыйОрдер.СоздатьДокумент();
	ДокументОбъект.Дата = ДатаДокумента;		
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ИнициализироватьРасшифровкуПлатежа(ДокументОбъект, РеквизитыОснования);
	ДокументОбъект.Записать();
	
	ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
	ЗаполнитьОтражениеФактаДДС(ДокументОснование, ДокументОбъект.Ссылка, ДанныеПозиций, "Первая", ФактическаяСумма);
	
	ДанныеЗаполнения = ДанныеЗаполненияПоступлениеЧерезКассу(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения,
							Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации);
	
	ДокументОбъект = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();	
	ДокументОбъект.Дата = ДатаДокумента;		
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ИнициализироватьРасшифровкуПлатежа(ДокументОбъект, РеквизитыОснования);
	ДокументОбъект.Записать();
	
	ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
	ЗаполнитьОтражениеФактаДДС(ДокументОснование, ДокументОбъект.Ссылка,ДанныеПозиций, "Вторая", ФактическаяСумма);

КонецПроцедуры

Процедура ЗаполнитьОплатуДенежныхСредствВДругуюОрганизациюЧерезБанк(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы)
		
	ДокументОснование 	 = РеквизитыОснования.Ссылка;
	ДанныеПозиций	  	 = ДанныеПозиций(ДокументОснование);
	СоздаватьПоступления = ПараметрыЗаполнения.СоздаватьПоступления;
	ДатаДокумента		 = ПараметрыЗаполнения.ДатаДокумента;
		
	СуммаДокумента	 = ПараметрыЗаполнения.СуммаДокумента;
	ФактическаяСумма = ПараметрыЗаполнения.ФактическаяСумма;
	
	ДанныеЗаполнения = ДанныеЗаполненияСписаниеЧерезБанк(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, 
							Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию);
		
	ДокументОбъект = Документы.СписаниеБезналичныхДенежныхСредств.СоздатьДокумент();
	//бит_Казначейство.ДополнитьНазначениеПлатежаСуммой(ДокументОбъект);
	ДокументОбъект.Дата = ДатаДокумента;		
	ДокументОбъект.Заполнить(ДанныеЗаполнения);	
	ИнициализироватьРасшифровкуПлатежа(ДокументОбъект, РеквизитыОснования);
	ДокументОбъект.Записать();
	
	Списание = ДокументОбъект.Ссылка;
	ПлатежныеДокументы.Добавить(Списание);
	ЗаполнитьОтражениеФактаДДС(ДокументОснование, Списание, ДанныеПозиций, "Первая", ФактическаяСумма);
	
	Если СоздаватьПоступления Тогда
				
		ДанныеЗаполнения = ДанныеЗаполненияПоступлениеЧерезБанк(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, 
								Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации);
				
		ДокументОбъект = Документы.ПоступлениеБезналичныхДенежныхСредств.СоздатьДокумент();
		//бит_Казначейство.ДополнитьНазначениеПлатежаСуммой(ДокументОбъект);
		ДокументОбъект.Дата = ДатаДокумента;	
		РеквизитыВходящего 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Списание, 
								"НомерВходящегоДокумента, ДатаВходящегоДокумента");
		ЗаполнитьЗначенияСвойств(ДокументОбъект, РеквизитыВходящего);
		ДокументОбъект.Заполнить(ДанныеЗаполнения);
		ИнициализироватьРасшифровкуПлатежа(ДокументОбъект, РеквизитыОснования);
		ДокументОбъект.Записать();
		
		ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
		ЗаполнитьОтражениеФактаДДС(ДокументОснование, ДокументОбъект.Ссылка, ДанныеПозиций, "Вторая", ФактическаяСумма);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьВозвратДенежныхСредствВДругуюОрганизациюЧерезКассу(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы)
	
	ДокументОснование = РеквизитыОснования.Ссылка;
	ДанныеПозиций	  = ДанныеПозиций(ДокументОснование);
	ДатаДокумента	  = ПараметрыЗаполнения.ДатаДокумента;
	ФактическаяСумма  = ПараметрыЗаполнения.ФактическаяСумма;	
	
	ДанныеЗаполнения = ДанныеЗаполненияСписаниеЧерезКассу(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения,
							Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию);

	ДокументОбъект = Документы.РасходныйКассовыйОрдер.СоздатьДокумент();
	ДокументОбъект.Дата = ДатаДокумента;		
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ИнициализироватьРасшифровкуПлатежа(ДокументОбъект, РеквизитыОснования);
	ДокументОбъект.Записать();
	
	ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
	ЗаполнитьОтражениеФактаДДС(ДокументОснование, ДокументОбъект.Ссылка, ДанныеПозиций, "Первая", ФактическаяСумма);
	
	ДанныеЗаполнения = ДанныеЗаполненияПоступлениеЧерезКассу(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения,
							Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации);
							
	ДокументОбъект = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
	ДокументОбъект.Дата = ДатаДокумента;		
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ИнициализироватьРасшифровкуПлатежа(ДокументОбъект, РеквизитыОснования);
	ДокументОбъект.Записать();
	
	ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
	ЗаполнитьОтражениеФактаДДС(ДокументОснование, ДокументОбъект.Ссылка,ДанныеПозиций, "Вторая", ФактическаяСумма);

КонецПроцедуры

Процедура ЗаполнитьВозвратДенежныхСредствВДругуюОрганизациюЧерезБанк(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы)
		
	ДокументОснование 	 = РеквизитыОснования.Ссылка;
	ДанныеПозиций	  	 = ДанныеПозиций(ДокументОснование);
	СоздаватьПоступления = ПараметрыЗаполнения.СоздаватьПоступления;
	ДатаДокумента	  	 = ПараметрыЗаполнения.ДатаДокумента;
	ФактическаяСумма	 = ПараметрыЗаполнения.ФактическаяСумма;
	
	ДанныеЗаполнения = ДанныеЗаполненияСписаниеЧерезБанк(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, 
							Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию);
	
	ДокументОбъект = Документы.СписаниеБезналичныхДенежныхСредств.СоздатьДокумент();
	//бит_Казначейство.ДополнитьНазначениеПлатежаСуммой(ДокументОбъект);
	ДокументОбъект.Дата = ДатаДокумента;		
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ИнициализироватьРасшифровкуПлатежа(ДокументОбъект, РеквизитыОснования);
	ДокументОбъект.Записать();
	
	Списание = ДокументОбъект.Ссылка;
	ПлатежныеДокументы.Добавить(Списание);
	ЗаполнитьОтражениеФактаДДС(ДокументОснование, Списание, ДанныеПозиций, "Первая", ФактическаяСумма);
	
	Если СоздаватьПоступления Тогда
		
		ДанныеЗаполнения = ДанныеЗаполненияПоступлениеЧерезБанк(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, 
								Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации);
		
		ДокументОбъект = Документы.ПоступлениеБезналичныхДенежныхСредств.СоздатьДокумент();
		//бит_Казначейство.ДополнитьНазначениеПлатежаСуммой(ДокументОбъект);
		ДокументОбъект.Дата = ДатаДокумента;
		РеквизитыВходящего 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Списание, 
								"НомерВходящегоДокумента, ДатаВходящегоДокумента");
		ЗаполнитьЗначенияСвойств(ДокументОбъект, РеквизитыВходящего);
		ДокументОбъект.Заполнить(ДанныеЗаполнения);
		ИнициализироватьРасшифровкуПлатежа(ДокументОбъект, РеквизитыОснования);
		ДокументОбъект.Записать();
		
		ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
		ЗаполнитьОтражениеФактаДДС(ДокументОснование, ДокументОбъект.Ссылка, ДанныеПозиций, "Вторая", ФактическаяСумма);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьВозвратДенежныхСредствОтДругойОрганизацииЧерезБанк(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы)

	ДокументОснование 	 = РеквизитыОснования.Ссылка;
	ДанныеПозиций	  	 = ДанныеПозиций(ДокументОснование);
	ДатаДокумента	  	 = ПараметрыЗаполнения.ДатаДокумента;
	ФактическаяСумма	 = ПараметрыЗаполнения.ФактическаяСумма;
	
	ДанныеЗаполнения = ДанныеЗаполненияПоступлениеЧерезБанк(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, 
							Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации);
	
	ДокументОбъект 		= Документы.ПоступлениеБезналичныхДенежныхСредств.СоздатьДокумент();
	ДокументОбъект.Дата = ДатаДокумента;
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ИнициализироватьРасшифровкуПлатежа(ДокументОбъект, РеквизитыОснования);
	ДокументОбъект.Записать();
	
	ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
	ЗаполнитьОтражениеФактаДДС(ДокументОснование, ДокументОбъект.Ссылка, ДанныеПозиций, "Первая", ФактическаяСумма);

КонецПроцедуры

Процедура ЗаполнитьВозвратДенежныхСредствОтДругойОрганизацииЧерезКассу(РеквизитыОснования, ПараметрыЗаполнения, ПлатежныеДокументы)

	ДокументОснование = РеквизитыОснования.Ссылка;
	ДанныеПозиций	  = ДанныеПозиций(ДокументОснование);
	ДатаДокумента	  = ПараметрыЗаполнения.ДатаДокумента;
	ФактическаяСумма  = ПараметрыЗаполнения.ФактическаяСумма;	
		
	ДанныеЗаполнения = ДанныеЗаполненияПоступлениеЧерезКассу(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения,
							Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации);
							
	ДокументОбъект = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
	ДокументОбъект.Дата = ДатаДокумента;		
	ДокументОбъект.Заполнить(ДанныеЗаполнения);
	ИнициализироватьРасшифровкуПлатежа(ДокументОбъект, РеквизитыОснования);
	ДокументОбъект.Записать();
	
	ПлатежныеДокументы.Добавить(ДокументОбъект.Ссылка);
	ЗаполнитьОтражениеФактаДДС(ДокументОснование, ДокументОбъект.Ссылка,ДанныеПозиций, "Первая", ФактическаяСумма);

КонецПроцедуры

Функция ДанныеЗаполненияСписаниеЧерезБанк(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, ВидОперации)

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", 				   РеквизитыОснования.Организация);
	ДанныеЗаполнения.Вставить("Подразделение", 				   Неопределено);
	ДанныеЗаполнения.Вставить("Валюта", 					   РеквизитыОснования.ВалютаДокумента);
	ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", 		   ВидОперации);
	ДанныеЗаполнения.Вставить("БанковскийСчет",				   ДанныеПозиций.ПлатежнаяПозиция.БанковскийСчет);
	ДанныеЗаполнения.Вставить("БанковскийСчетПолучатель", 	   ДанныеПозиций.ПозицияПоступления.БанковскийСчет);
	ДанныеЗаполнения.Вставить("ВидПлатежа", 			  	   "Электронно");
	ДанныеЗаполнения.Вставить("ОчередностьПлатежа", 	  	   5);
	ДанныеЗаполнения.Вставить("ТипПлатежногоДокумента",   	   Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение);
	ДанныеЗаполнения.Вставить("НазначениеПлатежа",			   ДанныеПозиций.ПлатежнаяПозиция.НазначениеПлатежа);
	ДанныеЗаполнения.Вставить("СуммаДокумента", 			   ПараметрыЗаполнения.СуммаДокумента);
	ДанныеЗаполнения.Вставить("СтатьяДвиженияДенежныхСредств", Неопределено);
	
	ЗаполнитьПодразделениеСтатьяДДС(РеквизитыОснования, ДанныеПозиций.ПлатежнаяПозиция, ДанныеЗаполнения);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Функция ДанныеЗаполненияПоступлениеЧерезБанк(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, ВидОперации)

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", 				   РеквизитыОснования.ОрганизацияПолучатель);
	ДанныеЗаполнения.Вставить("Подразделение", 				   Неопределено);
	ДанныеЗаполнения.Вставить("Валюта", 					   РеквизитыОснования.ВалютаДокумента);
	ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", 		   ВидОперации);
	ДанныеЗаполнения.Вставить("БанковскийСчет", 	   	   	   ДанныеПозиций.ПозицияПоступления.БанковскийСчет);
	ДанныеЗаполнения.Вставить("БанковскийСчетОтправитель", 	   ДанныеПозиций.ПлатежнаяПозиция.БанковскийСчет);
	ДанныеЗаполнения.Вставить("ТипПлатежногоДокумента",		   Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение);
	ДанныеЗаполнения.Вставить("НазначениеПлатежа", 		  	   ДанныеПозиций.ПозицияПоступления.НазначениеПлатежа);
	ДанныеЗаполнения.Вставить("СуммаДокумента",		   	   	   ПараметрыЗаполнения.СуммаДокумента);
	ДанныеЗаполнения.Вставить("СтатьяДвиженияДенежныхСредств", Неопределено);
	ДанныеЗаполнения.Вставить("НомерВходящегоДокумента", 	   "");
	ДанныеЗаполнения.Вставить("ДатаВходящегоДокумента", 	   '0001-01-01');
	
	ЗаполнитьПодразделениеСтатьяДДС(РеквизитыОснования, ДанныеПозиций.ПозицияПоступления, ДанныеЗаполнения);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Функция ДанныеЗаполненияСписаниеЧерезКассу(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, ВидОперации)

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация",   		   		   РеквизитыОснования.Организация);
	ДанныеЗаполнения.Вставить("Подразделение",				   Неопределено);
	ДанныеЗаполнения.Вставить("Валюта", 	   		   		   РеквизитыОснования.ВалютаДокумента);
	ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", 		   ВидОперации);
	ДанныеЗаполнения.Вставить("Касса", 	   	 		   		   ДанныеПозиций.ПлатежнаяПозиция.Касса);
	ДанныеЗаполнения.Вставить("КассаПолучатель", 	   		   ДанныеПозиций.ПозицияПоступления.Касса);
	ДанныеЗаполнения.Вставить("СуммаДокумента",		   		   ПараметрыЗаполнения.СуммаДокумента);
	ДанныеЗаполнения.Вставить("СтатьяДвиженияДенежныхСредств", Неопределено);

	ЗаполнитьПодразделениеСтатьяДДС(РеквизитыОснования, ДанныеПозиций.ПлатежнаяПозиция, ДанныеЗаполнения);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Функция ДанныеЗаполненияПоступлениеЧерезКассу(РеквизитыОснования, ДанныеПозиций, ПараметрыЗаполнения, ВидОперации)

	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация",   		   		   РеквизитыОснования.ОрганизацияПолучатель);
	ДанныеЗаполнения.Вставить("Подразделение",				   Неопределено);
	ДанныеЗаполнения.Вставить("Валюта", 	   		   		   РеквизитыОснования.ВалютаДокумента);
	ДанныеЗаполнения.Вставить("ХозяйственнаяОперация", 		   ВидОперации);
	ДанныеЗаполнения.Вставить("Касса", 	   	 		   		   ДанныеПозиций.ПозицияПоступления.Касса);
	ДанныеЗаполнения.Вставить("КассаОтправитель", 	   		   ДанныеПозиций.ПлатежнаяПозиция.Касса);
	ДанныеЗаполнения.Вставить("СуммаДокумента",		   		   ПараметрыЗаполнения.СуммаДокумента);
	ДанныеЗаполнения.Вставить("СтатьяДвиженияДенежныхСредств", Неопределено);

	ЗаполнитьПодразделениеСтатьяДДС(РеквизитыОснования, ДанныеПозиций.ПозицияПоступления, ДанныеЗаполнения);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

Функция ЗаполнитьПодразделениеСтатьяДДС(Основание, ДанныеПозиции, ДанныеЗаполнения)
	
	ОпределитьСтатьюДДС(ДанныеЗаполнения, ДанныеПозиции, Основание);
	
	Если ТипЗнч(ДанныеПозиции.Позиция) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция") Тогда
		Подразделение = Документы.бит_кзн_ПлатежнаяПозиция.ПодразделениеДополнительныеИзмерения(ДанныеПозиции.Позиция);
	Иначе
		Подразделение = Документы.бит_кзн_ПозицияПоступления.ПодразделениеДополнительныеИзмерения(ДанныеПозиции.Позиция);
	КонецЕсли;
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ДанныеЗаполнения.Подразделение = Подразделение;
	КонецЕсли;
	
КонецФункции

Процедура ИнициализироватьРасшифровкуПлатежа(Объект, Основание)

	Если Объект.РасшифровкаПлатежа.Количество() = 0 Тогда
		НоваяСтрока = Объект.РасшифровкаПлатежа.Добавить();
		НоваяСтрока.СтатьяДвиженияДенежныхСредств = Объект.СтатьяДвиженияДенежныхСредств;
		НоваяСтрока.Сумма = Объект.СуммаДокумента;
		НоваяСтрока.ВалютаВзаиморасчетов = Объект.Валюта;
		НоваяСтрока.КурсЧислительВзаиморасчетов = 1;
		НоваяСтрока.КурсЗнаменательВзаиморасчетов = 1;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Основание, "ОбъектРасчетов, СтавкаНДС, СуммаНДС");
		Если ЗначениеЗаполнено(НоваяСтрока.СтавкаНДС) Тогда
			СтавкаНДС = бит_СтавкиНДС.ЗначениеСтавкиНДС(НоваяСтрока.СтавкаНДС);
			НоваяСтрока.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(НоваяСтрока.Сумма, СтавкаНДС, Истина);
		Иначе
			Объект.СуммаНДС  = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьСтатьюДДС(Контейнер, ДанныеПозиции, ДокументОснование)
	
	СтатьяОборотов = ДанныеПозиции.СтатьяОборотов;
	ОбъектРасчетов = ДокументОснование.ОбъектРасчетов;
	
	ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	Если ЗначениеЗаполнено(ОбъектРасчетов) Тогда
		ДоговорКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектРасчетов, "Договор");
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		СтатьяДДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, "СтатьяДвиженияДенежныхСредств");
		Если ЗначениеЗаполнено(СтатьяДДС) Тогда
			Контейнер.СтатьяДвиженияДенежныхСредств = СтатьяДДС;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтатьяОборотов) Тогда
		СтатьяДДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтатьяОборотов, "ОсновнаяСтатьяДДС");
		Если ЗначениеЗаполнено(СтатьяДДС) Тогда
			Контейнер.СтатьяДвиженияДенежныхСредств = СтатьяДДС;
			Возврат;
		КонецЕсли;
	КонецЕсли;

	СтатьиДДС = РегистрыСведений.бит_СоответствияАналитик.ПолучитьЛевуюАналитику(
						Справочники.бит_ВидыСоответствийАналитик.СтатьиДДС_СтатьиОборотов, 
						СтатьяОборотов, ТекущаяДатаСеанса());
																
	Если СтатьиДДС.Количество() > 0 Тогда
		Контейнер.СтатьяДвиженияДенежныхСредств = СтатьиДДС[0];
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Контейнер.СтатьяДвиженияДенежныхСредств) Тогда
		ВидОперации	   = бит_Казначейство.ХозяйственнаяОперацияУП(ДокументОснование.ХозяйственнаяОперация);
		СтатьяКандидат = Справочники.СтатьиДвиженияДенежныхСредств.СтатьяДвиженияДенежныхСредствПоХозяйственнойОперации(ВидОперации);
		
		Если ЗначениеЗаполнено(СтатьяКандидат) Тогда
			Контейнер.СтатьяДвиженияДенежныхСредств = СтатьяКандидат;
		КонецЕсли;	
	КонецЕсли; 

КонецПроцедуры

Процедура ЗаполнитьОтражениеФактаДДС(ДокументПланирования, ДокументСсылка, ДанныеПозиций, РежимЗаполнения, СуммаКОплате)

	УстановитьПривилегированныйРежим(Истина);
	
	ЗаполнятьВсе = Ложь;
	ЗаполнятьПервую = Ложь;
	ЗаполнятьВторую = Ложь;
	
	Если РежимЗаполнения = "Обе" Тогда
		ЗаполнятьВсе = Истина;
		н = 1;
	ИначеЕсли РежимЗаполнения = "Первая" Тогда  
		ЗаполнятьПервую = Истина;
	ИначеЕсли РежимЗаполнения = "Вторая" Тогда  
		ЗаполнятьВторую = Истина;
		н = 0;
	КонецЕсли; 
	
	ПлатежнаяПозиция   = ДанныеПозиций.ПлатежнаяПозиция.Позиция;
	ПозицияПоступления = ДанныеПозиций.ПозицияПоступления.Позиция;

	ОтражениеФакта		 = Документы.бит_ОтражениеФактаДДС.НайтиДокументОтражение(ДокументСсылка);
	ОтражениеФактаОбъект = ОтражениеФакта.ПолучитьОбъект();
	ОтражениеФактаОбъект.НеСинхронизировать = Истина;
	
	Если ЗаполнятьВсе ИЛИ ЗаполнятьПервую Тогда	
		//Заполнение строки расходования
		СтрокаТаблицы = ОтражениеФактаОбъект.ФактическиеДанные[0];
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ПлатежнаяПозиция);
		
		Если СуммаКОплате <> 0 Тогда
			СтрокаТаблицы.Сумма = СуммаКОплате;
		Иначе
			Остатки = ПолучитьОстатокРасход(ДокументПланирования);
			СтрокаТаблицы.Сумма = Остатки.Остаток;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаполнятьВсе ИЛИ ЗаполнятьВторую Тогда
		//Заполнение строки поступления
		СтрокаТаблицы = ОтражениеФактаОбъект.ФактическиеДанные[н];
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ПозицияПоступления);
		
		Если СуммаКОплате <> 0 Тогда
			СтрокаТаблицы.Сумма = СуммаКОплате;
		Иначе
			Остатки = ПолучитьОстатокПоступление(ДокументПланирования);
			СтрокаТаблицы.Сумма = Остатки.Остаток;
		КонецЕсли;
	КонецЕсли; 
	
	бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ОтражениеФактаОбъект, РежимЗаписиДокумента.Запись, "", "Ошибки");

	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти // ЗаполнениеПлатежныхДокументов


#КонецОбласти

#КонецЕсли
